'''
Задание 4.
Написать функцию printNumbersUntil(num),
которая выводит на экран (print) 
все числа, начиная от 1 заканчивая num (включительно)

'''

# Testing:


def printNumbersUntil(n):
    pass


print("All numbers until 5:")
printNumbersUntil(5)

print("All numbers until 1:")
printNumbersUntil(1)

print("All numbers until 0:")
printNumbersUntil(0)

# Expected output:
# All numbers until 5:
# 1
# 2
# 3
# 4
# 5
# All numbers until 1:
# 1
# All numbers until 0:
# (ничего)
