'''
Задание 3.

1. В git создать новую ветку class-task3

2. Создать файл answer3.py (в папке class)
В этом файле будем писать программу на языке Питон.
Можно скопировать код из файла answer2.py и продолжить выполнение задания.

3. Добавить в класс Person методы:
* age(year) - принимает значение текущего года (например, 2021) и возвращает возраст человека

* output() - выводит на экран (print) информацию о данном человеке.
Например:
Петр Иванов (муж) 1992

4. Поместить объекты p1, p2, p3 в список people.
Проходим по всем элементам списка и выводим на экран только женщин младше 30 лет,
используя вновь созданный метод output() в классе Person().
Для определения возраста используем метод age() в классе Person() - и передаем ему значение текущего года (например, 2021).

Программа должна напечатать только одного человека:
Наталья Серафимович (жен) 1970

5. Создать git-коммит, отправить изменения в интернет (на GitHub)

6. На GitHub создать Pull Request - от ветки class-task1 в ветку main

'''
