'''
Задание 7. Методы.

1. Можно продолжить с задания 6 в том же файле.

2. У нас должно быть три класса: Human, Parent, Child.

3. Давайте в программе создадим

Шесть объектов класса Parent:
p1: 'Zoya', 'F', 33
p2: 'Boris', 'M', 28
p3: 'Vladimir', 'M', 45
p4: 'Olya', 'F', 41
p5: 'Sveta', 'F', 42
p6: 'Petr', 'M', 25

И три ребенка:
c1: 'Anya', 'F', 3 - родители p1 и p2
c2: 'Polya', 'F', 8 - родители p3 и p4
c3: 'Misha', 'M', 12 - родители p3 и p5

4. Поместим всех родителей в список - parents.
Поместим всех детей в отдельный список - children.

5. Добавим в классы Human метод - output().
Этот метод принимает один параметр - self
И выводит информацию о человеке - имя, пол, возраст.

6. Выведем на экран информацию о всех родителях с помощью функции output().
Подсказка: используем цикл по списку родителей

Пример:
Zoya, 'F', 33
Boris, 'M', 28
Vladimir, 'M', 45
Olya, 'F', 41
Sveta, 'F', 42
Petr, 'M', 25

7. Выведем на экран информацию обо всех детях с помощью функции output().

Пример:
'Anya', 'F', 3
'Polya', 'F', 8
'Misha', 'M', 12

8. Продолжаем в задании 8.
'''


